Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32WM_BZ6204_DFP/component/silex.h
/*
 * Component description for SILEX
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2025-01-29T18:23:31Z  */
#ifndef _PIC32WM_BZ6_SILEX_COMPONENT_H_
#define _PIC32WM_BZ6_SILEX_COMPONENT_H_

/* ************************************************************************** */
/*                     SOFTWARE API DEFINITION FOR SILEX                      */
/* ************************************************************************** */

/* -------- SILEX_DMA_FETCH_ADDR_LSB : (SILEX Offset: 0x00) (R/W 32)  -------- */
#define SILEX_DMA_FETCH_ADDR_LSB_RESETVALUE   _UINT32_(0x00)                                       /*  (SILEX_DMA_FETCH_ADDR_LSB)   Reset Value */

#define SILEX_DMA_FETCH_ADDR_LSB_FETCH_ADDR_LSB_Pos _UINT32_(0)                                          /* (SILEX_DMA_FETCH_ADDR_LSB)  Position */
#define SILEX_DMA_FETCH_ADDR_LSB_FETCH_ADDR_LSB_Msk (_UINT32_(0xFFFFFFFF) << SILEX_DMA_FETCH_ADDR_LSB_FETCH_ADDR_LSB_Pos) /* (SILEX_DMA_FETCH_ADDR_LSB)  Mask */
#define SILEX_DMA_FETCH_ADDR_LSB_FETCH_ADDR_LSB(value) (SILEX_DMA_FETCH_ADDR_LSB_FETCH_ADDR_LSB_Msk & (_UINT32_(value) << SILEX_DMA_FETCH_ADDR_LSB_FETCH_ADDR_LSB_Pos)) /* Assignment of value for FETCH_ADDR_LSB in the SILEX_DMA_FETCH_ADDR_LSB register */
#define SILEX_DMA_FETCH_ADDR_LSB_Msk          _UINT32_(0xFFFFFFFF)                                 /* (SILEX_DMA_FETCH_ADDR_LSB) Register Mask  */


/* -------- SILEX_DMA_FETCH_ADDR_MSB : (SILEX Offset: 0x04) (R/W 32)  -------- */
#define SILEX_DMA_FETCH_ADDR_MSB_RESETVALUE   _UINT32_(0x00)                                       /*  (SILEX_DMA_FETCH_ADDR_MSB)   Reset Value */

#define SILEX_DMA_FETCH_ADDR_MSB_FETCH_ADDR_MSB_Pos _UINT32_(0)                                          /* (SILEX_DMA_FETCH_ADDR_MSB)  Position */
#define SILEX_DMA_FETCH_ADDR_MSB_FETCH_ADDR_MSB_Msk (_UINT32_(0xFFFFFFFF) << SILEX_DMA_FETCH_ADDR_MSB_FETCH_ADDR_MSB_Pos) /* (SILEX_DMA_FETCH_ADDR_MSB)  Mask */
#define SILEX_DMA_FETCH_ADDR_MSB_FETCH_ADDR_MSB(value) (SILEX_DMA_FETCH_ADDR_MSB_FETCH_ADDR_MSB_Msk & (_UINT32_(value) << SILEX_DMA_FETCH_ADDR_MSB_FETCH_ADDR_MSB_Pos)) /* Assignment of value for FETCH_ADDR_MSB in the SILEX_DMA_FETCH_ADDR_MSB register */
#define SILEX_DMA_FETCH_ADDR_MSB_Msk          _UINT32_(0xFFFFFFFF)                                 /* (SILEX_DMA_FETCH_ADDR_MSB) Register Mask  */


/* -------- SILEX_DMA_FETCH_LEN : (SILEX Offset: 0x08) (R/W 32)  -------- */
#define SILEX_DMA_FETCH_LEN_RESETVALUE        _UINT32_(0x00)                                       /*  (SILEX_DMA_FETCH_LEN)   Reset Value */

#define SILEX_DMA_FETCH_LEN_FETCH_LEN_Pos     _UINT32_(0)                                          /* (SILEX_DMA_FETCH_LEN)  Position */
#define SILEX_DMA_FETCH_LEN_FETCH_LEN_Msk     (_UINT32_(0xFFFFFFF) << SILEX_DMA_FETCH_LEN_FETCH_LEN_Pos) /* (SILEX_DMA_FETCH_LEN)  Mask */
#define SILEX_DMA_FETCH_LEN_FETCH_LEN(value)  (SILEX_DMA_FETCH_LEN_FETCH_LEN_Msk & (_UINT32_(value) << SILEX_DMA_FETCH_LEN_FETCH_LEN_Pos)) /* Assignment of value for FETCH_LEN in the SILEX_DMA_FETCH_LEN register */
#define SILEX_DMA_FETCH_LEN_FETCH_CSTADDR_Pos _UINT32_(28)                                         /* (SILEX_DMA_FETCH_LEN)  Position */
#define SILEX_DMA_FETCH_LEN_FETCH_CSTADDR_Msk (_UINT32_(0x1) << SILEX_DMA_FETCH_LEN_FETCH_CSTADDR_Pos) /* (SILEX_DMA_FETCH_LEN)  Mask */
#define SILEX_DMA_FETCH_LEN_FETCH_CSTADDR(value) (SILEX_DMA_FETCH_LEN_FETCH_CSTADDR_Msk & (_UINT32_(value) << SILEX_DMA_FETCH_LEN_FETCH_CSTADDR_Pos)) /* Assignment of value for FETCH_CSTADDR in the SILEX_DMA_FETCH_LEN register */
#define SILEX_DMA_FETCH_LEN_FETCH_REALIGN_Pos _UINT32_(29)                                         /* (SILEX_DMA_FETCH_LEN)  Position */
#define SILEX_DMA_FETCH_LEN_FETCH_REALIGN_Msk (_UINT32_(0x1) << SILEX_DMA_FETCH_LEN_FETCH_REALIGN_Pos) /* (SILEX_DMA_FETCH_LEN)  Mask */
#define SILEX_DMA_FETCH_LEN_FETCH_REALIGN(value) (SILEX_DMA_FETCH_LEN_FETCH_REALIGN_Msk & (_UINT32_(value) << SILEX_DMA_FETCH_LEN_FETCH_REALIGN_Pos)) /* Assignment of value for FETCH_REALIGN in the SILEX_DMA_FETCH_LEN register */
#define SILEX_DMA_FETCH_LEN_FETCH_ZPADDING_Pos _UINT32_(30)                                         /* (SILEX_DMA_FETCH_LEN)  Position */
#define SILEX_DMA_FETCH_LEN_FETCH_ZPADDING_Msk (_UINT32_(0x1) << SILEX_DMA_FETCH_LEN_FETCH_ZPADDING_Pos) /* (SILEX_DMA_FETCH_LEN)  Mask */
#define SILEX_DMA_FETCH_LEN_FETCH_ZPADDING(value) (SILEX_DMA_FETCH_LEN_FETCH_ZPADDING_Msk & (_UINT32_(value) << SILEX_DMA_FETCH_LEN_FETCH_ZPADDING_Pos)) /* Assignment of value for FETCH_ZPADDING in the SILEX_DMA_FETCH_LEN register */
#define SILEX_DMA_FETCH_LEN_Msk               _UINT32_(0x7FFFFFFF)                                 /* (SILEX_DMA_FETCH_LEN) Register Mask  */


/* -------- SILEX_DMA_FETCH_TAG : (SILEX Offset: 0x0C) (R/W 32)  -------- */
#define SILEX_DMA_FETCH_TAG_RESETVALUE        _UINT32_(0x00)                                       /*  (SILEX_DMA_FETCH_TAG)   Reset Value */

#define SILEX_DMA_FETCH_TAG_FETCH_TAG_Pos     _UINT32_(0)                                          /* (SILEX_DMA_FETCH_TAG)  Position */
#define SILEX_DMA_FETCH_TAG_FETCH_TAG_Msk     (_UINT32_(0xFFFFFFFF) << SILEX_DMA_FETCH_TAG_FETCH_TAG_Pos) /* (SILEX_DMA_FETCH_TAG)  Mask */
#define SILEX_DMA_FETCH_TAG_FETCH_TAG(value)  (SILEX_DMA_FETCH_TAG_FETCH_TAG_Msk & (_UINT32_(value) << SILEX_DMA_FETCH_TAG_FETCH_TAG_Pos)) /* Assignment of value for FETCH_TAG in the SILEX_DMA_FETCH_TAG register */
#define SILEX_DMA_FETCH_TAG_Msk               _UINT32_(0xFFFFFFFF)                                 /* (SILEX_DMA_FETCH_TAG) Register Mask  */


/* -------- SILEX_DMA_PUSH_ADDR_LSB : (SILEX Offset: 0x10) (R/W 32)  -------- */
#define SILEX_DMA_PUSH_ADDR_LSB_RESETVALUE    _UINT32_(0x00)                                       /*  (SILEX_DMA_PUSH_ADDR_LSB)   Reset Value */

