Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32WM_BZ6204_DFP/component/silex.h
/* -------- SILEX_RNG_DATA_HWCONFIG : (SILEX Offset: 0x4058) ( R/ 32) Hardware configuration register. -------- */
#define SILEX_RNG_DATA_HWCONFIG_RESETVALUE    _UINT32_(0x00)                                       /*  (SILEX_RNG_DATA_HWCONFIG) Hardware configuration register.  Reset Value */

#define SILEX_RNG_DATA_HWCONFIG_NUMBOFRINGS_Pos _UINT32_(0)                                          /* (SILEX_RNG_DATA_HWCONFIG) Generic g_NumRings value. Position */
#define SILEX_RNG_DATA_HWCONFIG_NUMBOFRINGS_Msk (_UINT32_(0xFF) << SILEX_RNG_DATA_HWCONFIG_NUMBOFRINGS_Pos) /* (SILEX_RNG_DATA_HWCONFIG) Generic g_NumRings value. Mask */
#define SILEX_RNG_DATA_HWCONFIG_NUMBOFRINGS(value) (SILEX_RNG_DATA_HWCONFIG_NUMBOFRINGS_Msk & (_UINT32_(value) << SILEX_RNG_DATA_HWCONFIG_NUMBOFRINGS_Pos)) /* Assignment of value for NUMBOFRINGS in the SILEX_RNG_DATA_HWCONFIG register */
#define SILEX_RNG_DATA_HWCONFIG_AIS31_Pos     _UINT32_(8)                                          /* (SILEX_RNG_DATA_HWCONFIG) Generic g_AIS31 value. Position */
#define SILEX_RNG_DATA_HWCONFIG_AIS31_Msk     (_UINT32_(0x1) << SILEX_RNG_DATA_HWCONFIG_AIS31_Pos) /* (SILEX_RNG_DATA_HWCONFIG) Generic g_AIS31 value. Mask */
#define SILEX_RNG_DATA_HWCONFIG_AIS31(value)  (SILEX_RNG_DATA_HWCONFIG_AIS31_Msk & (_UINT32_(value) << SILEX_RNG_DATA_HWCONFIG_AIS31_Pos)) /* Assignment of value for AIS31 in the SILEX_RNG_DATA_HWCONFIG register */
#define SILEX_RNG_DATA_HWCONFIG_AIS31FULL_Pos _UINT32_(9)                                          /* (SILEX_RNG_DATA_HWCONFIG) Generic g_AIS31Full value. Position */
#define SILEX_RNG_DATA_HWCONFIG_AIS31FULL_Msk (_UINT32_(0x1) << SILEX_RNG_DATA_HWCONFIG_AIS31FULL_Pos) /* (SILEX_RNG_DATA_HWCONFIG) Generic g_AIS31Full value. Mask */
#define SILEX_RNG_DATA_HWCONFIG_AIS31FULL(value) (SILEX_RNG_DATA_HWCONFIG_AIS31FULL_Msk & (_UINT32_(value) << SILEX_RNG_DATA_HWCONFIG_AIS31FULL_Pos)) /* Assignment of value for AIS31FULL in the SILEX_RNG_DATA_HWCONFIG register */
#define SILEX_RNG_DATA_HWCONFIG_Msk           _UINT32_(0x000003FF)                                 /* (SILEX_RNG_DATA_HWCONFIG) Register Mask  */

#define SILEX_RNG_DATA_HWCONFIG_AIS_Pos       _UINT32_(8)                                          /* (SILEX_RNG_DATA_HWCONFIG Position) Generic g_AIS3x value. */
#define SILEX_RNG_DATA_HWCONFIG_AIS_Msk       (_UINT32_(0x1) << SILEX_RNG_DATA_HWCONFIG_AIS_Pos)   /* (SILEX_RNG_DATA_HWCONFIG Mask) AIS */
#define SILEX_RNG_DATA_HWCONFIG_AIS(value)    (SILEX_RNG_DATA_HWCONFIG_AIS_Msk & (_UINT32_(value) << SILEX_RNG_DATA_HWCONFIG_AIS_Pos)) 

/* -------- SILEX_CRYPTOCON : (SILEX Offset: 0x00) (R/W 32) Crypto control register. -------- */
#define SILEX_CRYPTOCON_RESETVALUE            _UINT32_(0x00)                                       /*  (SILEX_CRYPTOCON) Crypto control register.  Reset Value */

#define SILEX_CRYPTOCON_SWRST_Pos             _UINT32_(0)                                          /* (SILEX_CRYPTOCON) Software Reset Position */
#define SILEX_CRYPTOCON_SWRST_Msk             (_UINT32_(0x1) << SILEX_CRYPTOCON_SWRST_Pos)         /* (SILEX_CRYPTOCON) Software Reset Mask */
#define SILEX_CRYPTOCON_SWRST(value)          (SILEX_CRYPTOCON_SWRST_Msk & (_UINT32_(value) << SILEX_CRYPTOCON_SWRST_Pos)) /* Assignment of value for SWRST in the SILEX_CRYPTOCON register */
#define SILEX_CRYPTOCON_ENABLE_Pos            _UINT32_(1)                                          /* (SILEX_CRYPTOCON) Enable clock to SILEX Position */
#define SILEX_CRYPTOCON_ENABLE_Msk            (_UINT32_(0x1) << SILEX_CRYPTOCON_ENABLE_Pos)        /* (SILEX_CRYPTOCON) Enable clock to SILEX Mask */
#define SILEX_CRYPTOCON_ENABLE(value)         (SILEX_CRYPTOCON_ENABLE_Msk & (_UINT32_(value) << SILEX_CRYPTOCON_ENABLE_Pos)) /* Assignment of value for ENABLE in the SILEX_CRYPTOCON register */
#define SILEX_CRYPTOCON_RUNSTDBY_Pos          _UINT32_(6)                                          /* (SILEX_CRYPTOCON) Enable clock in idle mode Position */
#define SILEX_CRYPTOCON_RUNSTDBY_Msk          (_UINT32_(0x1) << SILEX_CRYPTOCON_RUNSTDBY_Pos)      /* (SILEX_CRYPTOCON) Enable clock in idle mode Mask */
#define SILEX_CRYPTOCON_RUNSTDBY(value)       (SILEX_CRYPTOCON_RUNSTDBY_Msk & (_UINT32_(value) << SILEX_CRYPTOCON_RUNSTDBY_Pos)) /* Assignment of value for RUNSTDBY in the SILEX_CRYPTOCON register */
#define SILEX_CRYPTOCON_Msk                   _UINT32_(0x00000043)                                 /* (SILEX_CRYPTOCON) Register Mask  */


/* SILEX register offsets definitions */
#define SILEX_DMA_FETCH_ADDR_LSB_REG_OFST _UINT32_(0x00)      /* (SILEX_DMA_FETCH_ADDR_LSB)  Offset */
#define SILEX_DMA_FETCH_ADDR_MSB_REG_OFST _UINT32_(0x04)      /* (SILEX_DMA_FETCH_ADDR_MSB)  Offset */
#define SILEX_DMA_FETCH_LEN_REG_OFST   _UINT32_(0x08)      /* (SILEX_DMA_FETCH_LEN)  Offset */
#define SILEX_DMA_FETCH_TAG_REG_OFST   _UINT32_(0x0C)      /* (SILEX_DMA_FETCH_TAG)  Offset */
#define SILEX_DMA_PUSH_ADDR_LSB_REG_OFST _UINT32_(0x10)      /* (SILEX_DMA_PUSH_ADDR_LSB)  Offset */
#define SILEX_DMA_PUSH_ADDR_MSB_REG_OFST _UINT32_(0x14)      /* (SILEX_DMA_PUSH_ADDR_MSB)  Offset */
#define SILEX_DMA_PUSH_LEN_REG_OFST    _UINT32_(0x18)      /* (SILEX_DMA_PUSH_LEN)  Offset */
#define SILEX_DMA_INT_EN_REG_OFST      _UINT32_(0x1C)      /* (SILEX_DMA_INT_EN)  Offset */
#define SILEX_DMA_INT_ENSET_REG_OFST   _UINT32_(0x20)      /* (SILEX_DMA_INT_ENSET)  Offset */
#define SILEX_DMA_INT_ENCLR_REG_OFST   _UINT32_(0x24)      /* (SILEX_DMA_INT_ENCLR)  Offset */
#define SILEX_DMA_INT_STATRAW_REG_OFST _UINT32_(0x28)      /* (SILEX_DMA_INT_STATRAW)  Offset */
#define SILEX_DMA_INT_STAT_REG_OFST    _UINT32_(0x2C)      /* (SILEX_DMA_INT_STAT)  Offset */
#define SILEX_DMA_INT_STATCLR_REG_OFST _UINT32_(0x30)      /* (SILEX_DMA_INT_STATCLR)  Offset */
#define SILEX_DMA_CONFIG_REG_OFST      _UINT32_(0x34)      /* (SILEX_DMA_CONFIG)  Offset */
#define SILEX_DMA_START_REG_OFST       _UINT32_(0x38)      /* (SILEX_DMA_START)  Offset */
#define SILEX_DMA_STATUS_REG_OFST      _UINT32_(0x3C)      /* (SILEX_DMA_STATUS)  Offset */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_REG_OFST _UINT32_(0x400)     /* (SILEX_HWCONF_INCL_IPS_HW_CFG)  Offset */
#define SILEX_HWCONF_BA411E_AES_HW_CFG_1_REG_OFST _UINT32_(0x404)     /* (SILEX_HWCONF_BA411E_AES_HW_CFG_1)  Offset */
#define SILEX_HWCONF_BA411E_AES_HW_CFG_2_REG_OFST _UINT32_(0x408)     /* (SILEX_HWCONF_BA411E_AES_HW_CFG_2) Generic g_CtrSize value. BA411E-AES engine configuration. Offset */
#define SILEX_HWCONF_BA413_HASH_HW_CFG_REG_OFST _UINT32_(0x40C)     /* (SILEX_HWCONF_BA413_HASH_HW_CFG)  Offset */
#define SILEX_HWCONF_BA418_SHA3_HW_CFG_REG_OFST _UINT32_(0x410)     /* (SILEX_HWCONF_BA418_SHA3_HW_CFG) Generic g_Sha3CtxtEn value. BA418-SHA3 configuration. Offset */
#define SILEX_HWCONF_BA419_SM4_HW_CFG_REG_OFST _UINT32_(0x414)     /* (SILEX_HWCONF_BA419_SM4_HW_CFG) Generic g_SM4ModesPoss value. BA419-SM4 engine configuration. Offset */
#define SILEX_HWCONF_BA424_ARIA_HW_CFG_REG_OFST _UINT32_(0x418)     /* (SILEX_HWCONF_BA424_ARIA_HW_CFG) Generic g_aria_modePoss value. BA424-Aria engine configuration. Offset */
#define SILEX_RNG_CONTROL_CONTROL_REG_OFST _UINT32_(0x1000)    /* (SILEX_RNG_CONTROL_CONTROL) Control register Offset */
#define SILEX_RNG_CONTROL_FIFOLEVEL_REG_OFST _UINT32_(0x1004)    /* (SILEX_RNG_CONTROL_FIFOLEVEL) FIFO level register. Offset */
#define SILEX_RNG_CONTROL_FIFOTHRESHOLD_REG_OFST _UINT32_(0x1008)    /* (SILEX_RNG_CONTROL_FIFOTHRESHOLD) FIFO threshold register. Offset */
#define SILEX_RNG_CONTROL_FIFODEPTH_REG_OFST _UINT32_(0x100C)    /* (SILEX_RNG_CONTROL_FIFODEPTH) FIFO depth register. Offset */
#define SILEX_RNG_CONTROL_KEY0_REG_OFST _UINT32_(0x1010)    /* (SILEX_RNG_CONTROL_KEY0) Key register (MSB). Offset */
#define SILEX_RNG_CONTROL_KEY1_REG_OFST _UINT32_(0x1014)    /* (SILEX_RNG_CONTROL_KEY1) Key register. Offset */
#define SILEX_RNG_CONTROL_KEY2_REG_OFST _UINT32_(0x1018)    /* (SILEX_RNG_CONTROL_KEY2) Key register. Offset */
#define SILEX_RNG_CONTROL_KEY3_REG_OFST _UINT32_(0x101C)    /* (SILEX_RNG_CONTROL_KEY3) Key register (LSB). Offset */
#define SILEX_RNG_CONTROL_TESTDATA_REG_OFST _UINT32_(0x1020)    /* (SILEX_RNG_CONTROL_TESTDATA) Test data register. Offset */
#define SILEX_RNG_CONTROL_REPEATTHRESHOLD_REG_OFST _UINT32_(0x1024)    /* (SILEX_RNG_CONTROL_REPEATTHRESHOLD) Repetition Test Count Cut-Off value. Offset */
#define SILEX_RNG_CONTROL_PROPTHRESHOLD_REG_OFST _UINT32_(0x1028)    /* (SILEX_RNG_CONTROL_PROPTHRESHOLD) Adaptive Proportion Test (1024-sample window) Cut-Off value. Offset */
#define SILEX_RNG_CONTROL_STATUS_REG_OFST _UINT32_(0x1030)    /* (SILEX_RNG_CONTROL_STATUS) Status register. Offset */
#define SILEX_RNG_CONTROL_INITWAITVAL_REG_OFST _UINT32_(0x1034)    /* (SILEX_RNG_CONTROL_INITWAITVAL) Initial wait counter value. Offset */
#define SILEX_RNG_CONTROL_DISABLEOSC0_REG_OFST _UINT32_(0x1038)    /* (SILEX_RNG_CONTROL_DISABLEOSC0) Disable oscillator rings #0 to #31. Offset */
#define SILEX_RNG_CONTROL_DISABLEOSC1_REG_OFST _UINT32_(0x103C)    /* (SILEX_RNG_CONTROL_DISABLEOSC1) Disable oscillator rings #32 to #63. Offset */
#define SILEX_RNG_CONTROL_SWOFFTMRVAL_REG_OFST _UINT32_(0x1040)    /* (SILEX_RNG_CONTROL_SWOFFTMRVAL) Switch off timer value. Offset */
#define SILEX_RNG_CONTROL_CLKDIV_REG_OFST _UINT32_(0x1044)    /* (SILEX_RNG_CONTROL_CLKDIV) Sample clock divider. Offset */
#define SILEX_RNG_CONTROL_AIS31CONF0_REG_OFST _UINT32_(0x1048)    /* (SILEX_RNG_CONTROL_AIS31CONF0) AIS31 configuration register 0. Offset */
#define SILEX_RNG_CONTROL_AIS31CONF1_REG_OFST _UINT32_(0x104C)    /* (SILEX_RNG_CONTROL_AIS31CONF1) AIS31 configuration register 1. Offset */
#define SILEX_RNG_CONTROL_AIS31CONF2_REG_OFST _UINT32_(0x1050)    /* (SILEX_RNG_CONTROL_AIS31CONF2) AIS31 configuration register 2. Offset */
#define SILEX_RNG_CONTROL_AIS31STATUS_REG_OFST _UINT32_(0x1054)    /* (SILEX_RNG_CONTROL_AIS31STATUS) AIS31 status register. Offset */
#define SILEX_RNG_CONTROL_HWCONFIG_REG_OFST _UINT32_(0x1058)    /* (SILEX_RNG_CONTROL_HWCONFIG) Hardware configuration register. Offset */
#define SILEX_PK_POINTERS_REG_OFST     _UINT32_(0x2000)    /* (SILEX_PK_POINTERS) Pointers register. Offset */
#define SILEX_PK_COMMAND_REG_OFST      _UINT32_(0x2004)    /* (SILEX_PK_COMMAND) Command register. Offset */
#define SILEX_PK_CONTROL_REG_OFST      _UINT32_(0x2008)    /* (SILEX_PK_CONTROL) Command register. Offset */
#define SILEX_PK_STATUS_REG_OFST       _UINT32_(0x200C)    /* (SILEX_PK_STATUS) Status register. Offset */
#define SILEX_PK_TIMER_REG_OFST        _UINT32_(0x2014)    /* (SILEX_PK_TIMER) Timer register. Offset */
#define SILEX_PK_HWCONFIG_REG_OFST     _UINT32_(0x2018)    /* (SILEX_PK_HWCONFIG) Hardware configuration register. Offset */
#define SILEX_PK_OPSIZE_REG_OFST       _UINT32_(0x201C)    /* (SILEX_PK_OPSIZE) Operand size register. Offset */
#define SILEX_PK_MEMOFFSET_REG_OFST    _UINT32_(0x2020)    /* (SILEX_PK_MEMOFFSET) Memory offset register. Offset */
#define SILEX_PK_MICROCODEOFFSET_REG_OFST _UINT32_(0x2024)    /* (SILEX_PK_MICROCODEOFFSET) MicroCode offset register. Offset */
#define SILEX_RNG_DATA_CONTROL_REG_OFST _UINT32_(0x4000)    /* (SILEX_RNG_DATA_CONTROL) Control register Offset */
#define SILEX_RNG_DATA_FIFOLEVEL_REG_OFST _UINT32_(0x4004)    /* (SILEX_RNG_DATA_FIFOLEVEL) FIFO level register. Offset */
#define SILEX_RNG_DATA_FIFOTHRESHOLD_REG_OFST _UINT32_(0x4008)    /* (SILEX_RNG_DATA_FIFOTHRESHOLD) FIFO threshold register. Offset */
#define SILEX_RNG_DATA_FIFODEPTH_REG_OFST _UINT32_(0x400C)    /* (SILEX_RNG_DATA_FIFODEPTH) FIFO depth register. Offset */
#define SILEX_RNG_DATA_KEY0_REG_OFST   _UINT32_(0x4010)    /* (SILEX_RNG_DATA_KEY0) Key register (MSB). Offset */
#define SILEX_RNG_DATA_KEY1_REG_OFST   _UINT32_(0x4014)    /* (SILEX_RNG_DATA_KEY1) Key register. Offset */
#define SILEX_RNG_DATA_KEY2_REG_OFST   _UINT32_(0x4018)    /* (SILEX_RNG_DATA_KEY2) Key register. Offset */
#define SILEX_RNG_DATA_KEY3_REG_OFST   _UINT32_(0x401C)    /* (SILEX_RNG_DATA_KEY3) Key register (LSB). Offset */
#define SILEX_RNG_DATA_TESTDATA_REG_OFST _UINT32_(0x4020)    /* (SILEX_RNG_DATA_TESTDATA) Test data register. Offset */
#define SILEX_RNG_DATA_REPEATTHRESHOLD_REG_OFST _UINT32_(0x4024)    /* (SILEX_RNG_DATA_REPEATTHRESHOLD) Repetition Test Count Cut-Off value. Offset */
#define SILEX_RNG_DATA_PROPTHRESHOLD_REG_OFST _UINT32_(0x4028)    /* (SILEX_RNG_DATA_PROPTHRESHOLD) Adaptive Proportion Test (1024-sample window) Cut-Off value. Offset */
#define SILEX_RNG_DATA_STATUS_REG_OFST _UINT32_(0x4030)    /* (SILEX_RNG_DATA_STATUS) Status register. Offset */
#define SILEX_RNG_DATA_INITWAITVAL_REG_OFST _UINT32_(0x4034)    /* (SILEX_RNG_DATA_INITWAITVAL) Initial wait counter value. Offset */
#define SILEX_RNG_DATA_DISABLEOSC0_REG_OFST _UINT32_(0x4038)    /* (SILEX_RNG_DATA_DISABLEOSC0) Disable oscillator rings #0 to #31. Offset */
#define SILEX_RNG_DATA_DISABLEOSC1_REG_OFST _UINT32_(0x403C)    /* (SILEX_RNG_DATA_DISABLEOSC1) Disable oscillator rings #32 to #63. Offset */
#define SILEX_RNG_DATA_SWOFFTMRVAL_REG_OFST _UINT32_(0x4040)    /* (SILEX_RNG_DATA_SWOFFTMRVAL) Switch off timer value. Offset */
#define SILEX_RNG_DATA_CLKDIV_REG_OFST _UINT32_(0x4044)    /* (SILEX_RNG_DATA_CLKDIV) Sample clock divider. Offset */
#define SILEX_RNG_DATA_AIS31CONF0_REG_OFST _UINT32_(0x4048)    /* (SILEX_RNG_DATA_AIS31CONF0) AIS31 configuration register 0. Offset */
#define SILEX_RNG_DATA_AIS31CONF1_REG_OFST _UINT32_(0x404C)    /* (SILEX_RNG_DATA_AIS31CONF1) AIS31 configuration register 1. Offset */
#define SILEX_RNG_DATA_AIS31CONF2_REG_OFST _UINT32_(0x4050)    /* (SILEX_RNG_DATA_AIS31CONF2) AIS31 configuration register 2. Offset */
#define SILEX_RNG_DATA_AIS31STATUS_REG_OFST _UINT32_(0x4054)    /* (SILEX_RNG_DATA_AIS31STATUS) AIS31 status register. Offset */
#define SILEX_RNG_DATA_HWCONFIG_REG_OFST _UINT32_(0x4058)    /* (SILEX_RNG_DATA_HWCONFIG) Hardware configuration register. Offset */
#define SILEX_CRYPTOCON_REG_OFST       _UINT32_(0x00)      /* (SILEX_CRYPTOCON) Crypto control register. Offset */

