Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32WM_BZ6204_DFP/component/silex.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* SFR register API structure */
typedef struct
{  /*  */
  __IO  uint32_t                       SILEX_DMA_FETCH_ADDR_LSB; /* Offset: 0x00 (R/W  32)  */
  __IO  uint32_t                       SILEX_DMA_FETCH_ADDR_MSB; /* Offset: 0x04 (R/W  32)  */
  __IO  uint32_t                       SILEX_DMA_FETCH_LEN; /* Offset: 0x08 (R/W  32)  */
  __IO  uint32_t                       SILEX_DMA_FETCH_TAG; /* Offset: 0x0C (R/W  32)  */
  __IO  uint32_t                       SILEX_DMA_PUSH_ADDR_LSB; /* Offset: 0x10 (R/W  32)  */
  __IO  uint32_t                       SILEX_DMA_PUSH_ADDR_MSB; /* Offset: 0x14 (R/W  32)  */
  __IO  uint32_t                       SILEX_DMA_PUSH_LEN; /* Offset: 0x18 (R/W  32)  */
  __IO  uint32_t                       SILEX_DMA_INT_EN;   /* Offset: 0x1C (R/W  32)  */
  __O   uint32_t                       SILEX_DMA_INT_ENSET; /* Offset: 0x20 ( /W  32)  */
  __O   uint32_t                       SILEX_DMA_INT_ENCLR; /* Offset: 0x24 ( /W  32)  */
  __I   uint32_t                       SILEX_DMA_INT_STATRAW; /* Offset: 0x28 (R/   32)  */
  __I   uint32_t                       SILEX_DMA_INT_STAT; /* Offset: 0x2C (R/   32)  */
  __O   uint32_t                       SILEX_DMA_INT_STATCLR; /* Offset: 0x30 ( /W  32)  */
  __IO  uint32_t                       SILEX_DMA_CONFIG;   /* Offset: 0x34 (R/W  32)  */
  __O   uint32_t                       SILEX_DMA_START;    /* Offset: 0x38 ( /W  32)  */
  __I   uint32_t                       SILEX_DMA_STATUS;   /* Offset: 0x3C (R/   32)  */
  __I   uint8_t                        Reserved1[0x3C0];
  __I   uint32_t                       SILEX_HWCONF_INCL_IPS_HW_CFG; /* Offset: 0x400 (R/   32)  */
  __I   uint32_t                       SILEX_HWCONF_BA411E_AES_HW_CFG_1; /* Offset: 0x404 (R/   32)  */
  __I   uint32_t                       SILEX_HWCONF_BA411E_AES_HW_CFG_2; /* Offset: 0x408 (R/   32) Generic g_CtrSize value. BA411E-AES engine configuration. */
  __I   uint32_t                       SILEX_HWCONF_BA413_HASH_HW_CFG; /* Offset: 0x40C (R/   32)  */
  __I   uint32_t                       SILEX_HWCONF_BA418_SHA3_HW_CFG; /* Offset: 0x410 (R/   32) Generic g_Sha3CtxtEn value. BA418-SHA3 configuration. */
  __I   uint32_t                       SILEX_HWCONF_BA419_SM4_HW_CFG; /* Offset: 0x414 (R/   32) Generic g_SM4ModesPoss value. BA419-SM4 engine configuration. */
  __I   uint32_t                       SILEX_HWCONF_BA424_ARIA_HW_CFG; /* Offset: 0x418 (R/   32) Generic g_aria_modePoss value. BA424-Aria engine configuration. */
  __I   uint8_t                        Reserved2[0xBE4];
  __IO  uint32_t                       SILEX_RNG_CONTROL_CONTROL; /* Offset: 0x1000 (R/W  32) Control register */
  __IO  uint32_t                       SILEX_RNG_CONTROL_FIFOLEVEL; /* Offset: 0x1004 (R/W  32) FIFO level register. */
  __IO  uint32_t                       SILEX_RNG_CONTROL_FIFOTHRESHOLD; /* Offset: 0x1008 (R/W  32) FIFO threshold register. */
  __I   uint32_t                       SILEX_RNG_CONTROL_FIFODEPTH; /* Offset: 0x100C (R/   32) FIFO depth register. */
  __IO  uint32_t                       SILEX_RNG_CONTROL_KEY0; /* Offset: 0x1010 (R/W  32) Key register (MSB). */
  __IO  uint32_t                       SILEX_RNG_CONTROL_KEY1; /* Offset: 0x1014 (R/W  32) Key register. */
  __IO  uint32_t                       SILEX_RNG_CONTROL_KEY2; /* Offset: 0x1018 (R/W  32) Key register. */
  __IO  uint32_t                       SILEX_RNG_CONTROL_KEY3; /* Offset: 0x101C (R/W  32) Key register (LSB). */
  __O   uint32_t                       SILEX_RNG_CONTROL_TESTDATA; /* Offset: 0x1020 ( /W  32) Test data register. */
  __IO  uint32_t                       SILEX_RNG_CONTROL_REPEATTHRESHOLD; /* Offset: 0x1024 (R/W  32) Repetition Test Count Cut-Off value. */
  __IO  uint32_t                       SILEX_RNG_CONTROL_PROPTHRESHOLD; /* Offset: 0x1028 (R/W  32) Adaptive Proportion Test (1024-sample window) Cut-Off value. */
  __I   uint8_t                        Reserved3[0x04];
  __IO  uint32_t                       SILEX_RNG_CONTROL_STATUS; /* Offset: 0x1030 (R/W  32) Status register. */
  __IO  uint32_t                       SILEX_RNG_CONTROL_INITWAITVAL; /* Offset: 0x1034 (R/W  32) Initial wait counter value. */
  __IO  uint32_t                       SILEX_RNG_CONTROL_DISABLEOSC0; /* Offset: 0x1038 (R/W  32) Disable oscillator rings #0 to #31. */
  __IO  uint32_t                       SILEX_RNG_CONTROL_DISABLEOSC1; /* Offset: 0x103C (R/W  32) Disable oscillator rings #32 to #63. */
  __IO  uint32_t                       SILEX_RNG_CONTROL_SWOFFTMRVAL; /* Offset: 0x1040 (R/W  32) Switch off timer value. */
  __IO  uint32_t                       SILEX_RNG_CONTROL_CLKDIV; /* Offset: 0x1044 (R/W  32) Sample clock divider. */
  __IO  uint32_t                       SILEX_RNG_CONTROL_AIS31CONF0; /* Offset: 0x1048 (R/W  32) AIS31 configuration register 0. */
  __IO  uint32_t                       SILEX_RNG_CONTROL_AIS31CONF1; /* Offset: 0x104C (R/W  32) AIS31 configuration register 1. */
  __IO  uint32_t                       SILEX_RNG_CONTROL_AIS31CONF2; /* Offset: 0x1050 (R/W  32) AIS31 configuration register 2. */
  __IO  uint32_t                       SILEX_RNG_CONTROL_AIS31STATUS; /* Offset: 0x1054 (R/W  32) AIS31 status register. */
  __I   uint32_t                       SILEX_RNG_CONTROL_HWCONFIG; /* Offset: 0x1058 (R/   32) Hardware configuration register. */
  __I   uint8_t                        Reserved4[0xFA4];
  __IO  uint32_t                       SILEX_PK_POINTERS;  /* Offset: 0x2000 (R/W  32) Pointers register. */
  __IO  uint32_t                       SILEX_PK_COMMAND;   /* Offset: 0x2004 (R/W  32) Command register. */
  __O   uint32_t                       SILEX_PK_CONTROL;   /* Offset: 0x2008 ( /W  32) Command register. */
  __I   uint32_t                       SILEX_PK_STATUS;    /* Offset: 0x200C (R/   32) Status register. */
  __I   uint8_t                        Reserved5[0x04];
  __IO  uint32_t                       SILEX_PK_TIMER;     /* Offset: 0x2014 (R/W  32) Timer register. */
  __I   uint32_t                       SILEX_PK_HWCONFIG;  /* Offset: 0x2018 (R/   32) Hardware configuration register. */
  __IO  uint32_t                       SILEX_PK_OPSIZE;    /* Offset: 0x201C (R/W  32) Operand size register. */
  __IO  uint32_t                       SILEX_PK_MEMOFFSET; /* Offset: 0x2020 (R/W  32) Memory offset register. */
  __IO  uint32_t                       SILEX_PK_MICROCODEOFFSET; /* Offset: 0x2024 (R/W  32) MicroCode offset register. */
  __I   uint8_t                        Reserved6[0x1FD8];
  __IO  uint32_t                       SILEX_RNG_DATA_CONTROL; /* Offset: 0x4000 (R/W  32) Control register */
  __IO  uint32_t                       SILEX_RNG_DATA_FIFOLEVEL; /* Offset: 0x4004 (R/W  32) FIFO level register. */
  __IO  uint32_t                       SILEX_RNG_DATA_FIFOTHRESHOLD; /* Offset: 0x4008 (R/W  32) FIFO threshold register. */
  __I   uint32_t                       SILEX_RNG_DATA_FIFODEPTH; /* Offset: 0x400C (R/   32) FIFO depth register. */
  __IO  uint32_t                       SILEX_RNG_DATA_KEY0; /* Offset: 0x4010 (R/W  32) Key register (MSB). */
  __IO  uint32_t                       SILEX_RNG_DATA_KEY1; /* Offset: 0x4014 (R/W  32) Key register. */
  __IO  uint32_t                       SILEX_RNG_DATA_KEY2; /* Offset: 0x4018 (R/W  32) Key register. */
  __IO  uint32_t                       SILEX_RNG_DATA_KEY3; /* Offset: 0x401C (R/W  32) Key register (LSB). */
  __O   uint32_t                       SILEX_RNG_DATA_TESTDATA; /* Offset: 0x4020 ( /W  32) Test data register. */
  __IO  uint32_t                       SILEX_RNG_DATA_REPEATTHRESHOLD; /* Offset: 0x4024 (R/W  32) Repetition Test Count Cut-Off value. */
  __IO  uint32_t                       SILEX_RNG_DATA_PROPTHRESHOLD; /* Offset: 0x4028 (R/W  32) Adaptive Proportion Test (1024-sample window) Cut-Off value. */
  __I   uint8_t                        Reserved7[0x04];
  __IO  uint32_t                       SILEX_RNG_DATA_STATUS; /* Offset: 0x4030 (R/W  32) Status register. */
  __IO  uint32_t                       SILEX_RNG_DATA_INITWAITVAL; /* Offset: 0x4034 (R/W  32) Initial wait counter value. */
  __IO  uint32_t                       SILEX_RNG_DATA_DISABLEOSC0; /* Offset: 0x4038 (R/W  32) Disable oscillator rings #0 to #31. */
  __IO  uint32_t                       SILEX_RNG_DATA_DISABLEOSC1; /* Offset: 0x403C (R/W  32) Disable oscillator rings #32 to #63. */
  __IO  uint32_t                       SILEX_RNG_DATA_SWOFFTMRVAL; /* Offset: 0x4040 (R/W  32) Switch off timer value. */
  __IO  uint32_t                       SILEX_RNG_DATA_CLKDIV; /* Offset: 0x4044 (R/W  32) Sample clock divider. */
  __IO  uint32_t                       SILEX_RNG_DATA_AIS31CONF0; /* Offset: 0x4048 (R/W  32) AIS31 configuration register 0. */
  __IO  uint32_t                       SILEX_RNG_DATA_AIS31CONF1; /* Offset: 0x404C (R/W  32) AIS31 configuration register 1. */
  __IO  uint32_t                       SILEX_RNG_DATA_AIS31CONF2; /* Offset: 0x4050 (R/W  32) AIS31 configuration register 2. */
  __IO  uint32_t                       SILEX_RNG_DATA_AIS31STATUS; /* Offset: 0x4054 (R/W  32) AIS31 status register. */
  __I   uint32_t                       SILEX_RNG_DATA_HWCONFIG; /* Offset: 0x4058 (R/   32) Hardware configuration register. */
} silex_sfr_registers_t;

#define SILEX_SFR_NUMBER 1

/* SILEX register API structure */
typedef struct
{  /*  */
  __IO  uint32_t                       SILEX_CRYPTOCON;    /* Offset: 0x00 (R/W  32) Crypto control register. */
  __I   uint8_t                        Reserved1[0xFFFC];
        silex_sfr_registers_t          SFR[SILEX_SFR_NUMBER]; /* Offset: 0x10000  */
} silex_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32WM_BZ6_SILEX_COMPONENT_H_ */
